docs/performance/raw/20260926-a022-335/w150-cap120/k6-warmup.txt


  █ THRESHOLDS 

    http_req_duration{name:confirm}
    ✓ 'p(95)<60000' p(95)=3.04s

    http_req_duration{name:read}
    ✓ 'p(95)<60000' p(95)=11.27ms


  █ TOTAL RESULTS 

    checks_total.......: 1       0.054657/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    ✓ login 200

    CUSTOM
    checkout_ok_200................: 151    8.253191/s

    HTTP
    http_req_duration..............: avg=765.63ms min=4.26ms med=7.67ms max=3.13s   p(90)=3.03s   p(95)=3.04s  
      { expected_response:true }...: avg=765.63ms min=4.26ms med=7.67ms max=3.13s   p(90)=3.03s   p(95)=3.04s  
      { name:confirm }.............: avg=3.03s    min=3.02s  med=3.03s  max=3.13s   p(90)=3.04s   p(95)=3.04s  
      { name:read }................: avg=7.19ms   min=4.26ms med=6.49ms max=24.53ms p(90)=10.34ms p(95)=11.27ms
    http_req_failed................: 0.00%  0 out of 604
    http_reqs......................: 604    33.012763/s

    EXECUTION
    iteration_duration.............: avg=1.02s    min=4.33ms med=8.83ms max=3.2s    p(90)=3.05s   p(95)=3.05s  
    iterations.....................: 452    24.704916/s
    vus............................: 4      min=4        max=31 
    vus_max........................: 220    min=220      max=220

    NETWORK
    data_received..................: 1.8 MB 100 kB/s
    data_sent......................: 260 kB 14 kB/s